AdrianoRuseler/LAUNCHXL-F28379D/C2000Ware/examples/cpu1/usb_dev_keyboard/cpu01/usb_dev_keyboard.c
            //
            // Has the suspend state changed since last time we checked?
            //
            if(bLastSuspend != g_bSuspended)
            {
                //
                // Yes - the state changed so update the display.
                //
                bLastSuspend = g_bSuspended;
                UARTprintf(bLastSuspend ? "Bus suspended...\n" :
                           "Host connected...\n");
                if(bLastSuspend)
                {

                }
                else
                {

                }
            }

            //
            // See if the button was just pressed.
            //
            //TODO: Read GPIO that was select for the pushbutton
            //      ui32Button = GPIOPinRead(GPIO_PORTB_BASE, GPIO_PIN_4);
            if((ui32Button == 0) && (ui32Previous != 0))
            {
                //
                // If the bus is suspended then resume it.  Otherwise, type
                // some "random" characters.
                //
                if(g_bSuspended)
                {
                    USBDHIDKeyboardRemoteWakeupRequest(
                        (void *)&g_sKeyboardDevice);
                }
                else
                {
                    SendString("Make the Switch to TI Microcontrollers!");
                }
            }
            ui32Previous = ui32Button;

            //
            // Wait for at least 1 system tick to have gone by before we poll
            // the buttons again.
            //
            while(g_ui32SysTickCount == ui32LastTickCount)
            {
            }
        }
    }
}

//
// End of file
//
